Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: གང་འདི་དེ་བཞིན་གཤེགས་པས་རྒན་རབས་དང་། བར་མ་དང་གསར་བུ་རྣམས་ཀྱི་བསླབ་པའི་ལམ་བསྟན་པ་
en: They are experts on the points of training that the thus-gone ones teach for senior, intermediate, and beginning students.

source: དེ་ལ་འདི་ལྟ་སྟེ། དོན་དང་། ཚིག་དང་། འབྱུང་བ་ལ་མཁས་པ་དང་།
en: They know the relevant meanings, words, and their relationship.

source: གཞན་གྱི་དྲིང་མི་འཇོག་ཅིང་གཞན་གྱིས་མི་བཀྲི་བ་ཡིན་ནོ།
en: They do not depend on the favors of others and cannot be led astray.

source: དེ་ལྟུང་བ་བྱུང་ན་ལྟུང་བ་ལས་འབྱུང་བ་རབ་ཏུ་ཤེས་ཤིང་གནས་དེ་དག་ཀྱང་ཡོངས་སུ་སྤོང་ངོ་།
en: They know well how to restore their commitments in the case of a downfall, and they give up the bases for such downfalls.

source: གནས་དེ་དག་ལ་གུས་པ་བྱེད་ཅིང་འཆགས་པ་མང་བ་ཡིན་ནོ།
en: They take such downfalls seriously and confess them extensively.

source: སྡིག་པ་དེ་ལ་སྨོད་ཅིང་འགྱོད་དེ་མཐོལ་བར་བྱེད་དོ།
en: Deploring evil, they regret it and confess it.

source: གནས་གང་དག་ཏུ་ལྟུང་བར་འགྱུར་བ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས། གང་དག་ཏུ་མི་འགྱུར་བ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས།
en: They know clearly what the causes of downfalls are, and they know well how to stay clear of them.

source: གང་དག་ཏུ་ཆེན་པོར་འགྱུར་བ་དང་། གང་དག་ཏུ་འབྲིང་དང་། གང་དག་ཏུ་ཆུང་ངུར་འགྱུར་བ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས།
en: They know clearly what the greater, medium, and lesser evils are,

source: གང་ལས་ཀྱི་རྣམ་པར་སྨིན་པའི་ཡུན་ཇི་སྲིད་པ་དེ་དག་ཡང་རབ་ཏུ་ཤེས་ཏེ།
en: just as they know the lengths of time required for karmic actions to ripen.

source: དེ་ཡང་ནན་ཏན་གྱིས་སྒྲུབ་བོ།
en: Thus, they endeavor in practice.

source: དེ་མིག་གི་དབང་པོ་མ་ཉམས་པ་དང་། རྣ་བའི་དབང་པོ་མ་ཉམས་ཤིང་ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་མ་ཉམས་པར་དགོན་པ་ན་གནས་ཏེ།
en: “Free of impairments to the visual and auditory faculties, as well as to the major and minor body parts, they remain in the wilderness,

source: གནས་གང་ན་འཚེ་བ་མེད་པའི་གནས་དེ་དག་ཏུ་གནས་སོ།
en: at any location that is free from harm.

source: གནས་གང་དག་ན་བསོད་སྙོམས་བླངས་པའི་སྤྱོད་ཡུལ་དང་། ཧ་ཅང་ཡང་མི་རིང་ཧ་ཅང་ཡང་མི་ཉེ་བ་དང་།
en: They stay in places that are neither too far nor too close to where they go to receive alms;

source: གནས་གང་དག་ན་ཆུ་དང་ཞིང་རྙོག་པ་མེད་པ།
en: places where there is pure and unpolluted water;

source: གཙང་ཞིང་དྲི་མ་མེད་པ། ཚེགས་ཆུང་བ་ཡོད་པ་དང་།
en: places that are clean, without bad smells, and with only little hardship;

source: གནས་གང་དག་ན་ཤིང་ཕུན་སུམ་ཚོགས་པ། མེ་ཏོག་ཕུན་སུམ་ཚོགས་པ། འབྲས་བུ་ཕུན་སུམ་ཚོགས་པ། ལོ་མ་ཕུན་སུམ་ཚོགས་པ།
en: places with excellent trees, flowers, fruits, and leaves;

source: གཅན་གཟན་ཁྲོ་བོ་མེད་པ།
en: places that are free from attacks by beasts of prey;

source: ཕུག་དང་ལྡན་པ།
en: places with caves;

source: སྨན་གཤོང་དང་ལྡན་པ།
en: places where natural medicines can be found;

source: ཐག་ཐུག་མེད་པ།
en: places that are not rugged;

source: འགྲོ་ན་བདེ་བ། ཞི་བ་གཉིས་སུ་མེད་པའི་གནས་དེ་འདྲ་བ་དག་ན་གནས་སོ།
en: places that are delightful to move in; and places that are nothing but peaceful. Such are the places in which they stay.

source: དེ་གནས་དེ་དག་ན་གནས་ཤིང་གང་དེས་སྔོན་བླགས་པ་དང་། སྔོན་ཐོས་པ་དེ་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་སྒྲ་
en: “In such places they will recite what they previously read and heard, three times during the day and three times at night.

source: ཧ་ཅང་ཡང་མི་ཆེ་ཧ་ཅང་ཡང་མི་ཆུང་བ་དང་། དབང་པོ་མི་རྒོད་ཅིང་ཕྱི་རོལ་ཏུ་མ་སོང་བའི་སེམས་
en: Their voices will neither be too loud nor too soft, nor will their senses be agitated, nor their minds outwardly distracted.

source: དད་པས་ཉེ་བར་འཚོ་ཞིང་ཚིག་ཉེ་བར་བཟུང་སྟེ། མཚན་མ་འཛིན་ཅིང་གཉིད་ཀྱིས་མ་ལོག་པར་ཁ་ཐོན་བྱེད་དོ།
en: Nourished by faith, they will recall the words and embrace their meanings, reciting while staying clear of sleep.

source: གལ་ཏེ་དགེ་སློང་དགོན་པ་པའི་དྲུང་དུ་རྒྱལ་པོའམ། བློན་པོ་ཆེན་པོ འམ། དེ་མ་ཡིན་པ་གཞན་བྲམ་ཟེའམ། རྒྱལ་རིགས་སམ། གྲོང་པའམ། ཡུལ་གྱི་མི་དག་འོངས་ན། དེས་དེ་དག་ལ་གུས་པར་ལེགས་པར་འོངས་སོ་ཞེས་བརྗོད་པར་བྱ་སྟེ།
en: “If anyone, whether a king, minister, brahmin, nobleman, townsperson, or country dweller should appear there, the monk should respectfully welcome that person.

source: དེས་རྒྱལ་པོ་ཆེན་པོ་ཇི་ལྟར་གདན་བཏིང་པ་ལ་བཞུགས་ཤིག་ཅེས་
en: A king should first be requested to sit on a seat especially prepared for him.

source: དེ་སྐད་བྱས་ནས་གལ་ཏེ་འདུག་ན་གཉི་ག་ཡང་འདུག་པར་བྱའོ། །དེ་སྟེ་མི་འདུག་ན་གཉི་ག་ཡང་མི་འདུག་པར་བྱའོ།
en: If the king sits down, the monk should do the same, yet if he does not, the monk should also not sit down.

source: གལ་ཏེ་དབང་པོ་རྒོད་པར་གྱུར་ན་རྒྱལ་པོ་ཆེན་པོ་གང་ཁྱོད་ཀྱིས་ཕྱོགས་ན་དགེ་སློང་དང་། བྲམ་ཟེ་རྣམས་ཚུལ་ཁྲིམས་དང་ལྡན་པ། ཡོན་ཏན་དང་ལྡན་པ། མང་དུ་ཐོས་པ་དག་མི་རྒོད་དང་། སྤྲེའུ་རྣམས་ཀྱིས་མ་གཙེས་པར་གནས་པ་དེ་ནི་རྙེད་པ་ལེགས་པར་རྙེད་དོ་ཞེས་བསྟོད་པར་བྱའོ།
en: Should the king become agitated, the monk should praise him, saying, ‘Your Majesty, thanks to you the disciplined, well-trained, and learned monks and brahmins of this land are free from oppression by savages and monkeys. This is indeed a great fortune!’

source: དེ་སྟེ་བརྟན་ཞིང་དུལ་ལ་དབང་པོ་རབ་ཏུ་ཞི་བ་ཞིག་ཡིན་ཏེ།
en: With that the king may settle down, become gentle, and relax.

source: ཆོས་བསྟན་པར་རུང་ན་དེ་ལ་ཆོས་སྣ་ཚོགས་བསྟན་པར་བྱའོ།
en: Then, if appropriate, he should give various Dharma teachings.

source: དེ་སྟེ་ཆོས་སྣ་ཚོགས་བསྟན་པ་ལ་མི་དགའ་ན་དེ་ལ་སྐྱོ་བ་དང་འཐུན་པའི་ཆོས་བསྟན་པར་བྱའོ།
en: However, if the king does not appreciate numerous teachings, he should first give a teaching that induces weariness.

source: དེ་སྟེ་སྐྱོ་བ་དང་འཐུན་པའི་ཆོས་བསྟན་པ་ལ་མི་དགའ་ན་དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ཆེ་བ་རྒྱ་ཆེ་བ། རྒྱ་ཆེ་བ་དག་བསྟན་པར་བྱའོ།
en: Then, if the king turns out to be disinclined toward such teaching, one should teach on the magnificence of the thus-gone ones, speaking of their vast qualities.

source: བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། གྲོང་པ་དང་། ཡུལ་གྱི་མི་དག་འོངས་ན་ཡང་ཅི་རིགས་པར་བྱ་བ་དག་བྱའོ།
en: If brahmins, nobility, townspeople, or country dwellers arrive he should receive them in a similar way.

source: དེ་དེ་ལྟར་མང་དུ་ཐོས་པས་ཆོས་ཉན་པ་རྣམས་ཀྱི་སེམས་མགུ་བར་བྱེད་ནུས་པ་ཡིན་ཏེ།
en: “In this way, those who possess great learning will have the power to satisfy the minds of their listeners,

source: སེམས་ཅན་དེ་དག་ཀྱང་དེ་ལ་དགའ་བ་དང་། དད་པ་དང་། རངས་པ་འཐོབ་པར་འགྱུར་རོ།
en: and their listeners will, in turn, experience joy, faith, and delight.

source: ཉོན་མོངས་པ་ཀུན་ནས་ལངས་པ་རྣམས་ཀྱི་གཉེན་པོ་ཡང་ནུས་པ་ཡིན་ནོ།
en: Thus, the learned will also be able to remedy the perpetuation of afflictions.

source: མང་དུ་ཐོས་པའི་སྟོབས་བསྐྱེད་པས་བདག་ཏུ་འཛིན་པའི་འཇིགས་པ་དང་བྲལ་བ་ཡིན་ནོ།
en: “Since the bodhisattvas are learned, they are free from the dangers of grasping at self.

source: དེ་བདག་ཏུ་འཛིན་པའི་འཇིགས་པ་དང་བྲལ་བས་དགོན་པ་དེ་ན་མི་འཇིགས། མི་སྐྲག །མི་དངང་བག་ཚ་བ་མེད་ཅིང་། རབ་ཏུ་དབེན་པ་ལ་མངོན་ཏུ་ཕྱོགས་པར་གྱུར་ཏེ་གནས་སོ།
en: Being free from such fears, they will also not have any fears, anxieties, or qualms about staying in the wilderness, and so they will turn toward complete solitude.

source: དེ་དགོན་པ་དེ་ན་དབེན་པ་ལ་མངོན་དུ་ཕྱོགས་ཤིང་འདུ་འཛི་མེད་པར་གནས་པས་རི་དགས་དང་འདྲ་བ་ཡིན་ནོ།
en: Then, living in the wild and having turned toward complete solitude, they will become uninvolved in ordinary social activities, like deer.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དགོན་པ་པ་ནི་རི་དགས་ལྟར་རྟག་ཏུ་འཇིགས་པ་མ་ཡིན་ཏེ། དེ་ལ་རི་དགས་ཀྱི་ཉེས་པ་ཡང་མེད་མོད་ཀྱི།
en: However, noble son, unlike deer, bodhisattvas who live in the wild are not constantly afraid and they do not have any of the shortcomings of deer.

source: ཇི་ལྟར་རི་དགས་དག་བདག་འདིའི་ལན་བོན་གྱིས་སྲོག་གི་བར་ཆད་དུ་གྱུར་དུ་འོང་ངོ་ཞེས་ཡུལ་དང་ཡུལ་གྱི་ཕྱོགས་རིང་པོ་བས་ཀྱང་རིང་པོར་སྤོང་བ་
en: Deer worry that their pursuers will bring an end to their life, and so they take off, leaving the land behind and crossing the greatest of distances.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་བདག་འདིའི་ལན་བོན་གྱིས་ཡི་དམ་གྱི་བར་ཆད་དམ། སེམས་གཡེངས་པར་གྱུར་ན་མི་རུང་ངོ་
en: Bodhisattvas, similarly, worry that their pursuers will bring an end to their commitment and cause them to become distracted.

source: ཞེས་བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་རྣམས་དང་འདུ་འཛི་མི་བྱེད་ཅིང་འདུ་འཛི་དག་ཐག་རིང་པོ་བས་ཀྱང་རིང་པོར་ཡོངས་སུ་སྤོང་ངོ་།
en: Thus, they avoid socializing with women, men, boys, and girls. Refraining from involvement in worldly distractions, they leave all social ties far behind.

source: དེ་དེ་ལྟར་ཐག་བསྲིངས་ཏེ་གནས་པས་རབ་ཏུ་དབེན་པ་ལ་མངོན་དུ་ཕྱོགས་པ་ཡིན།
en: In this way they keep their distance, having turned toward complete solitude.

source: དེ་རབ་ཏུ་དབེན་པ་ལ་མངོན་དུ་ཕྱོགས་པས་དགོན་པ་དེ་ལ་ཡོན་ཏན་དུ་ལྟ་བ་དང་། ཞི་བར་ལྟ་བ་ཡིན།
en: Being in this way inclined to utter solitude, they perceive the wilderness to be a place of excellent qualities and a place of peace.

source: དེ་ཡོན་ཏན་དུ་ལྟ་ཞིང་ཞི་བར་ལྟ་བས་ན་མི་དགའ་བ་དང་མི་འདྲེའོ།
en: Perceiving their hermitage to be excellent and peaceful, they will stay clear of displeasure,

source: མི་དགའ་བ་དང་མ་འདྲེས་པས་ན་དགོན་པའི་ཆོས་རྣམས་ཡང་དག་པར་བླངས་ནས་སྤྱོད་དེ།
en: as they stay clear of displeasure they will truly experience the qualities of the wilderness.

source: དེ་ལྟར་ན་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཡུན་རིང་པོ་ནས་ཚངས་པར་སྤྱད་པ་ལ་གནས་པ་ནས་མི་དགའ་བ་དང་མ་འདྲེས་པའི་བར་དུ་ཡིན་ནོ།
en: “Noble son, from their having maintained pure conduct for a long time through to their staying clear of displeasure, this is how bodhisattvas are.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དགོན་པ་པ་རྣམས་ཡིན་ནོ།
en: Thus, noble son, bodhisattvas who possess ten such qualities remain in the wild.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤིང་དྲུང་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities remain at the foot of a tree.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། གྲོང་དང་ཧ་ཅང་ཉེ་བའི་ཤིང་དྲུང་དུ་མི་རྟེན། གྲོང་དང་ཧ་ཅང་རིང་བའི་ཤིང་དྲུང་དུ་མི་རྟེན། ལྡམ་ལྡུམ་ཚེར་མ་ཅན་གྱིས་གང་བའི་ཤིང་དྲུང་དུ་མི་རྟེན། ཤིང་མ་ལུ་ཏ་དང་། ཀ་བྱ་ཀ་ཙུའི་འཁྲི་ཤིང་གིས་གང་བའི་ཤིང་དྲུང་དུ་མི་རྟེན། ཤིང་ལོ་མ་སྐམས་པའི་ཤིང་དྲུང་དུ་མི་རྟེན། སྤྲེའུ་གནས་པའི་ཤིང་དྲུང་དུ་མི་རྟེན། བྱ་གནས་པའི་ཤིང་དྲུང་དུ་མི་རྟེན། གཅན་གཟན་ཁྲོ་བོ་གནས་པའི་ཤིང་དྲུང་དུ་མི་རྟེན། འདྲོན་པོ་གནས་པའི་ཤིང་དྲུང་དུ་མི་རྟེན། མི་གཡོན་ཅན་གནས་པའི་ཤིང་དྲུང་དུ་མི་རྟེན་གྱི།
en: What are those ten? They refrain from sitting at a tree that is very near to town, very far from town, full of thorny fruits, covered by malu creepers or vine, has withered leaves, or is the home of monkeys, the home of birds, the home of aggressive carnivores, the home of herons, or the home of demons.

source: གང་ན་ལུས་བག་ཡངས་ཤིང་སེམས་དགའ་བར་འགྱུར་བའི་ཤིང་དྲུང་དེ་ལྟ་བུར་རྟེན་ཏོ།
en: Thus, they reside at trees that are agreeable to the body and delightful to the mind.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤིང་དྲུང་བ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities remain at the foot of a tree.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བླ་གབ་མེད་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities are shelterless.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དགུན་ནམ། དཔྱིད་དམ། དབྱར་རམ། སྟོན་ཡང་རུང་སྟེ། རྩིག་དྲུང་ན་མི་གནས། ཤིང་དྲུང་ན་མ་ཡིན། སོག་མ་སྤུངས་པར་མ་ཡིན།
en: What are those ten? They are as follows. Whether it is winter, summer, monsoon, or fall, these bodhisattvas do not remain near walls, trees, or haystacks.

source: རིའི་སྨན་གཤོང་དུ་མ་ཡིན། ཆུ་ལྐོག་ཏུ་མ་ཡིན།
en: They do not stay in mountain caves, and they do not hide from water.

source: གྲང་བ་སྐྱོབ་པར་ཡང་མི་བྱེད། རླུང་སྐྱོབ་པར་མ་ཡིན། ཆར་པ་སྐྱོབ་པ་མ་ཡིན། ཉི་མ་སྐྱོབ་པ་མ་ཡིན། བ་མོའི་སྐྱབས་ཀྱང་མི་བྱེད་ཀྱི།
en: Neither do they seek any protection from cold, wind, rain, sun, or frost.

source: གཞན་དུ་ན་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་བླ་གབ་མེད་པ་པ་ན་མ་ལུས་ཀྱིས་མི་ནུས་པར་གྱུར་ན། དེས་གཙུག་ལག་ཁང་དུ་གནས་ཏེ་
en: However, if shelterless bodhisattvas are physically unable to endure that, they should take up residence at a temple.

source: ཉོན་མོངས་པའི་གཉེན་པོའི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་སྦྱངས་པའི་ཡོན་ཏན་བཅས་ཏེ། ཅི་ནས་ཀྱང་བདག་གཙུག་ལག་ཁང་ན་གནས་བཞིན་དུ་ཉོན་མོངས་པ་རྣམས་སྤོང་བར་འབད་པ་དེ་ལྟར་བྱའོ་ཞེས་དེ་ལྟར་སེམས་བསྐྱེད་པར་བྱའོ།
en: There they should make the following resolve: ‘The thus-gone ones undertook ascetic practices in order to remedy the afflictions. So now, while I stay at this temple, I will strive by all means to eliminate the afflictions.’

source: གཙུག་ལག་ཁང་དེ་ལ་ཡང་ཆགས་པ་མི་སྐྱེད་དེ་ཞེན་པར་ཡང་མ་ཡིན་ནོ།
en: Without developing any craving or attachments with respect to the temple,

source: དེ་ཡང་འདི་ལྟར་སེམས་ཏེ། སྦྱིན་པའི་བདག་པོ་རྣམས་ལ་ཕན་གདགས་པར་བྱའི། བདག་ཅག་གིས་བདག་ཉིད་གསོ་བར་མི་བྱའོ་སྙམ་སྟེ།
en: they will bring to mind, ‘We act for the benefit of the sponsors, and not for the sake of maintaining our own livelihood.’

source: དེ་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་བླ་གབ་མེད་པའི་འདུ་ཤེས་ཉེ་བར་འཇོག་པ་ཡིན་ནོ།
en: In this way, they can maintain the notion of always being without any shelter.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བླ་གབ་མེད་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities are the shelterless.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དུར་ཁྲོད་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities are charnel ground dwellers.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། གནས་གང་ན་གནས་ཀྱང་རུང་། སྐྱོ་བ་མང་བ་རྣམས་ཡིན། དེ་དག་ཤི་བའི་འདུ་ཤེས་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་ཉེ་བར་གཞོག་པ་ཡིན། དེ་དག་རྣམ་པར་ཟོས་པར་འདུ་ཤེས་པ་དང་། རྣམ་པར་དམར་བར་འདུ་ཤེས་པ་དང་། རྣམ་པར་སྔོས་པར་འདུ་ཤེས་པ་དང་། རྣམ་པར་རུལ་པར་འདུ་ཤེས་པ་དང་། རྣམ་པར་བམ་པར་འདུ་ཤེས་པ་དང་། རྣམ་པར་ཚིག་པར་འདུ་ཤེས་པ་དང་། རྣམ་པར་འཐོར་བར་འདུ་ཤེས་པ་དང་། ཀེང་རུས་སུ་འདུ་ཤེས་པ་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་ཉེ་བར་གཞོག་པ་ཡིན་ནོ།
en: What are those ten? They are to feel greatly disenchanted, wherever they may be, as well as to continuously maintain the notions of death, the devoured, the bloody, the bruised, the rotting, the decomposing, the burning, the scattered, and the skeletal.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དུར་ཁྲོད་པས་ནི་བྱམས་པའི་སེམས་སུ་བྱའོ། །ཕན་པའི་སེམས་དང་། སེམས་ཅན་ལ་སྙིང་བརྩེ་བ་དང་།
en: “Noble son, charnel ground-dwelling bodhisattvas should have a loving mind, wishing to be of benefit, and they should have affection for beings.

source: ཚུལ་ཁྲིམས་དང་། གཙང་སྦྲའི་ཆོ་ག་དང་ལྡན་ཞིང་ཤ་དང་འབགས་པ་མེད་པར་བྱའོ།
en: They should be disciplined, observe pure conduct, and be free from worldly concerns.

source: རིགས་ཀྱི་བུ་དེ་ཅིའི་ཕྱིར་ཞེ་ན། དུར་ཁྲོད་གམ་ཡོ་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཤ་ཟ་བ་མཐོང་ན་མ་དད་པ་སྐྱེ་ཞིང་
en: Otherwise, noble son, those who live near the charnel ground may perceive such a bodhisattva to be a flesh-eating demon and lose faith,

source: གཙེ་བར་སེམས་པའི་མི་མ་ཡིན་པ་དག་གནས་པ་ཡོད་དོ།
en: malicious nonhuman beings may be attracted.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དུར་ཁྲོད་པས་གཙུག་ལག་ཁང་དུ་ཞུགས་ཏེ།
en: “Noble son, when the charnel ground-dwelling bodhisattvas enter a temple,

source: དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་ཕྱག་བྱས་དགེ་སློང་རྒན་རབས་རྣམས་ལ་ཕྱག་བྱས་ཏེ།
en: they should prostrate to a shrine devoted to the thus-gone ones and to the elder monks.

source: གསར་བུ་རྣམས་ཀྱང་དགའ་བར་བྱས་ལ་འགྲེང་སྟེ་འདུག་པར་བྱའོ།
en: To the younger monks they should show their appreciation and, in their presence, remain standing.

source: དགེ་འདུན་གྱི་མལ་སྟན་ལ་འདུག་པར་མི་བྱའོ།
en: They should not sit on any of the seats that are designated for the saṅgha.

source: རིགས་ཀྱི་བུ་དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཡིད་དང་སྦྱར་བར་བྱ་སྟེ།
en: Noble son, why is that? Because a bodhisattva should have consideration for the mindset of mundane people, and

source: བྱང་ཆུབ་སེམས་དཔའ་དུར་ཁྲོད་པ་ནི་འཕགས་པ་མ་ཡིན་པའི་འཇིག་རྟེན་དང་མི་འཐུན་
en: a charnel ground-dwelling bodhisattva is in disharmony with worldly people who are not noble.

source: འཕགས་པ་དང་ནི་མི་འཐུན་པ་མེད་དོ།
en: they are certainly not in disharmony with noble beings.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་དུར་ཁྲོད་པ་གང་ཟག་གི་མལ་སྟན་ལ་བདར་ན་དེས་ཅི་ནས་ཀྱང་འགྱོད་པར་མི་འགྱུར་ལ། གཞན་གྱིས་ཀྱང་དཔྱ་བར་མི་འགྱུར་བར་ཤིན་ཏུ་རྟོགས་པར་བྱས་ལ།
en: So charnel ground-dwelling bodhisattvas understand that if they adapt themselves to others’ seats, they themselves will be free of any regrets and no one will blame them.

source: དགེ་སློང་དེའི་བསམ་པ་ཡང་ཤེས་ནས་གདོད་སྟན་དེ་ལ་གདོལ་བུ་དང་འདྲ་བར་དམའ་བའི་སེམས་ཀྱིས་སྟན་དེ་ལ་འདུག་པར་བྱའོ།
en: Hence, they will first find out the sentiments of the monks and only then take a seat, doing so as humbly as an outcast.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དུར་ཁྲོད་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities are charnel ground dwellers.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཅོག་པུ་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities are tent dwellers.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལུས་ཡོངས་སུ་གདུང་བར་བྱ་བའི་ཕྱིར་འདུག་པ་མ་ཡིན། སེམས་ཡོངས་སུ་གདུང་བར་བྱ་བའི་ཕྱིར་འདུག་པ་མ་ཡིན།
en: What are those ten? They are as follows. Bodhisattvas do not remain in tents so as to torment the body, nor do they do so for the sake of any mental penance.

source: གཉིད་ཀྱིས་ནོན་ཏེ་འདུག་པ་མ་ཡིན། ལུས་དུབ་པས་འདུག་པ་མ་ཡིན་གྱི་
en: They also do not live in tents because of being overcome by sleep, nor because of being physically exhausted.

source: བྱང་ཆུབ་སེམས་དཔའ་ཅོག་པུ་པ་འདུག་པ་ནི་བྱང་ཆུབ་ཀྱི་ཚོགས་ཡོངས་སུ་བཀང་བའི་ཕྱིར་འདུག་གོ།
en: they do so for the sake of accomplishing the accumulations for awakening.

source: སེམས་རྩེ་གཅིག་ཏུ་བྱ་བའི་ཕྱིར་འདུག་གོ། །ལམ་མངོན་དུ་བྱ་བའི་ཕྱིར་འདུག་གོ། །བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བར་བྱ་བའི་ཕྱིར་འདུག་གོ། །སེམས་ཅན་ལ་ཕན་པའི་ཕྱིར་འདུག་གོ། །ཉོན་མོངས་པ་ཐམས་ཅད་སྤང་བའི་ཕྱིར་འདུག་གོ།
en: They do so in order to achieve a one-pointed mind, actualize the path, proceed to the seat of awakening, benefit sentient beings, and eliminate all afflictions.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཅོག་པུ་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities are tent dwellers.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་གཞི་ཇི་བཞིན་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities stay just where they are.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མལ་སྟན་ལ་མ་ཆགས་པ་རྣམས་ཡིན། བདག་ཉིད་ཀྱང་མལ་སྟན་མི་འདིང་། གཞན་དག་ཀྱང་འདིང་དུ་མི་འཇུག །གདིང་བའི་ཕྱིར་བརྡ་མི་བྱེད་ཅིང་།
en: What are those ten? They are as follows. Without any attachment to beds, they neither prepare one for themselves, nor make others prepare one, nor make any gestures for a bed to be prepared.

source: གཞན་དུ་ན་ལོ་མས་གང་བའམ། རྩྭས་གང་བའི་གནས་ཀྱང་རུང་སྟེ། གནས་དེ་དག་ཏུ་ཉལ་བར་བྱེད་ཅིང་ས་གང་གི་ཕྱོགས་ན་སྦྲུལ་གྱིས་གང་བའམ། སྦྲང་མ་དང་། ཤ་སྦྲང་གིས་གང་བའམ། ཁུང་མང་བ་དེ་དག་རིང་པོ་བས་ཀྱང་རིང་པོར་ཡོངས་སུ་སྤོང་ངོ་།
en: Instead, they sleep on a spot filled with leaves or grass very far from places with snakes, bees, meat flies, or holes in the ground.

source: དེ་དག་ཉལ་བ་ན་གློ་གཡས་པས་ཉལ་བར་བྱེད་དེ། རྐང་པའི་སྟེང་དུ་རྐང་པ་བཞག་ནས། ལུས་ཆོས་གོས་དག་གིས་ཤིན་ཏུ་གཡོགས་ཤིང་
en: When sleeping, they lie on their right side, with one leg on top of the other, and the body wrapped in the Dharma robes.

source: དྲན་པ་དང་ཤེས་བཞིན་དུ་སྣང་བའི་འདུ་ཤེས་དང་ལྡང་བའི་འདུ་ཤེས་སུ་ཉལ་བར་བྱེད་དེ།
en: They sleep mindfully and with alertness, keeping a sense of light and of being awake.

source: གཉིད་ཀྱི་བདེ་བ་ལ་ཆགས་པར་མི་བྱེད། སྙེས་པའི་བདེ་བ་ལ་ཡང་མ་ཡིན་ཏེ།
en: They are not attached to the pleasures of sleep, or of resting.

source: གཞན་དུ་ན་དེ་དག་ཅི་ཙམ་དུ་འབྱུང་བ་ཆེན་པོ་རྣམས་གནས་ཤིང་འཚོ་བའི་ཕྱིར་ཉལ་བར་བྱེད་ལ། རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་ཡང་དགེ་བའི་ཕྱོགས་ལ་མངོན་དུ་ཕྱོགས་པ་རྣམས་ཡིན་ནོ།
en: Instead, they sleep for the sake of maintaining and replenishing the great elements, while continuously aiming toward virtue.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་གཞི་ཇི་བཞིན་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities stay just where they are.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣལ་འབྱོར་སྤྱོད་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities engage in yogic practice.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མི་སྡུག་པ་བསྒོམ་པ་མང་བ་རྣམས་ཡིན། བྱམས་པ་བསྒོམ་པ་མང་བ་རྣམས་ཡིན། །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་བསྒོམ་པ་མང་བ་རྣམས་ཡིན། སྐྱོན་ལ་མཁས་པ་མང་བ་རྣམས་ཡིན། སྟོང་པ་ཉིད་བསྒོམ་པ་མང་བ་རྣམས་ཡིན། མཚན་མ་མེད་པ་བསྒོམ་པ་མང་བ་རྣམས་ཡིན། རྣལ་འབྱོར་བསྒོམ་པ་མང་བ་རྣམས་ཡིན། རྒྱུན་དུ་བསྒོམ་པ་མང་བ་རྣམས་ཡིན། འགྱོད་པ་མེད་པ་རྣམས་ཡིན། ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are abundant contemplation of repulsiveness, abundant cultivation of love, abundant contemplation of dependent origination, abundant expertise with regard to flaws, abundant contemplation of emptiness, abundant contemplation of the absence of marks, abundant cultivation of yogic training, abundant and continuous contemplation, absence of regrets, and perfect discipline.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་སྡུག་པ་བསྒོམ་པ་མང་བ་ཡིན་ཞེ་ན།
en: “Noble son, you may wonder what the bodhisattvas’ abundant contemplation of repulsiveness consists in.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་པུ་དབེན་པར་སོང་སྟེ། ནང་དུ་ཡང་དག་པར་བཞག་ནས་རབ་ཏུ་དབེན་པ་ལ་མངོན་དུ་ཕྱོགས་ཤིང་ཤིན་ཏུ་སྐྱོ་བའི་སེམས་ཀྱིས་
en: Noble son, bodhisattvas will go alone into the wilderness and compose themselves, with their minds withdrawn and extremely weary.

source: ལུས་དྲང་པོ་དྲང་པོ་དང་། ལུས་བགས་ཀྱིས་གློད་པས་
en: They will then sit completely upright and slowly loosen their posture.

source: སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་དྲན་པ་མངོན་དུ་བཞག་སྟེ། ཕྱི་རོལ་ཏུ་མ་བྱུང་བའི་སེམས་ཀྱིས་དེ་འདི་སྙམ་དུ་སེམས་སོ།
en: Sitting cross-legged, they will recollect themselves and, without letting their minds wander, they will think as follows:

source: ཇི་སྙེད་དུ་མིའི་ནང་ན་ཁ་ཟས་དང་། ཟས་སྐོམ་གཙང་མ་ཡང་རུང་། བཟང་པོ་ཡང་རུང་། ངན་པ་ཡང་རུང་།
en: ‘When food and drink enters the human body, it does not matter whether it is clean and fine, or of bad quality.

source: རོ་ཕུན་སུམ་ཚོགས་པ་ཡང་རུང་། རོ་ཆུང་བ་ཡང་རུང་སྟེ།
en: It makes no difference whether it is delicious or has little taste.

source: དེ་ཐམས་ཅད་ལུས་ཀྱི་མེས་རེག་པ་དང་། བཙོག་པར་འགྱུར་ཏེ། རུལ་ཅིང་དྲི་ང་བ་དང་། འཇིག་རྟེན་ཐམས་ཅད་དང་མི་འཕྲོད་པ་ཡིན་ན།
en: Once it comes in contact with the body’s fire element, it all becomes filthy and rotten, reviled by the whole world.

source: དེ་ལ་བྱིས་པ་འདི་དག་ནི་ཤིན་ཏུ་ཞེན་ཅིང་རབ་ཏུ་ཆགས་སོ།
en: How then can childish beings be so attached and desirous?

source: བདག་ཅག་ནི་འཕགས་པའི་ཆོས་འདུལ་བ་ལ་གནས་ཏེ།
en: Now, we are the followers of the noble ones’ Dharma-Vinaya and,

source: ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་བརྟགས་ཏེ།
en: analyzing things by means of genuine insight,

source: འདི་འདྲ་བའི་ལུས་ལ་མ་ཞེན་མ་ཆགས་པར་བྱའོ།
en: we shall not harbor any attachment or craving with regard to the body,

source: དེའི་ཕྱིར་སྐྱོ་བའི་སེམས་ཀྱང་མི་བསྐྱེད་དོ་སྙམ་སྟེ།
en: therefore we shall also not give rise to any weariness.’

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་སྡུག་པ་བསྒོམ་པ་མང་བ་ཡིན་ནོ།
en: Such is the bodhisattvas’ abundant contemplation of repulsiveness.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་བསྒོམ་པ་མང་བ་ཡིན་ཞེ་ན།
en: “What, you may wonder, does the bodhisattvas’ abundant cultivation of love consist in?

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་པུ་འབྱུང་བར་འགྱུར་ཏེ། ནང་དུ་ཡང་དག་པར་བཞག་ནས་རབ་ཏུ་དབེན་པ་ལ་མངོན་དུ་ཕྱོགས་ཏེ། ཤིན་ཏུ་སྐྱོ་བའི་སེམས་ཀྱིས་
en: Noble son, bodhisattvas will go alone and compose themselves, with their minds withdrawn and extremely weary.

source: སེམས་ཅན་གང་དག་ཁྲོ་བ་དང་། གནོད་སེམས་མང་བ།
en: ‘Aggressive beings and those who strongly wish to cause harm,

source: མི་དགེ་བའི་ལས་བྱེད་པ་རྣམས་དང་། གང་རྣམས་བདག་ལ་རྒོལ་བ་དང་། དགྲ་བོ་གཅུགས་མེད་པར་ཤར་གཉེར་བ་རྣམས་
en: those who engage in unvirtuous acts, and those who attack me, seeking enemies and animosity

source: བྱུང་བའམ། འབྱུང་བར་འགྱུར་བ་ཡང་རུང་སྟེ། བདག་གིས་དེ་དག་ཐམས་ཅད་ཀྱི་ཁྲོ་བ་དང་། གནོད་སེམས་རབ་ཏུ་ཞི་བར་བྱས་ཏེ། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འགོད་པར་བྱའོ།
en: —whether now or in the future, may I completely calm their anger and ill will and establish them all upon the seat of awakening!’

source: དེ་ཡང་ངག་ཙམ་གྱིས་མ་ཡིན་གྱི་བསམ་པ་ཐག་པས་སེམས་ཏེ།
en: They do not merely say so; they wish it from the bottom of their hearts.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་བསྒོམ་པ་མང་བ་ཡིན་ནོ།
en: Such is the bodhisattvas’ abundant cultivation of love.
